In [1]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt
plt.rcParams['figure.figsize'] = [12, 8]

import warnings
warnings.filterwarnings("ignore")

# ABOUT THE DATA SET

The dataset comprises of 2 job categories that are Application Consultant & JAVA Developer.

In [2]:
data = pd.read_csv('new_data.csv',encoding ='ISO-8859-1')#importing data
data.head()

                 Category                                            Resumes
0  Application Consultant   samama hill view block  gulistanejauhar karac...
1          JAVA developer  contactykphotmailcomwwwlinkedincominmuhammadmu...
2  Application Consultant  a experience   worked on several projects majo...
3  Application Consultant  \nArsalan  Alam  Siddiqui  \n\nComplete curren...
4  Application Consultant  Contactstd_20585@iobm.edu.pkwww.linkedin.com/i...

In [4]:
data.describe().transpose()

         count unique                                                top freq
Category    99      2                             Application Consultant   65
Resumes     99     61  Education Details \r\nJanuary 2016 B.E Informa...    6